БухЭксп/InformationRegisters/ОператорыЭДО.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ОператорыЭДО</Name>
			<InformationRegisterPeriodicity>Nonperiodical</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Представление</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ИНН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КПП</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОГРН</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СпособОбменаЭД</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СпособыОбменаЭД</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтпечатокСертификата</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ДоступноПодключениеЧерез1С</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОтправлятьДополнительныеСведения</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СсылкаНаСтраницуТехническойПоддержки</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ЕстьШаблонСоглашенияНаРоуминг</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>РасширениеФайлаСоглашенияНаРоуминг</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>СрокДействияСоглашенияНаРоуминг</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>УдалитьДоступноПодключениеБезОГРН</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ОднородныйОтветНаВсеДокументыПакета</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПриРегистрацииПредставителяТребуетсяМЧД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>25</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоддерживаемыеПриРегистрацииПредставителяТипыМЧД</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>НеподдерживаемыеФорматы</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальноеКоличествоЭДВПакете</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>3</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>МаксимальныйРазмерПакетаЭД</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>КодОшибкиНедействительныхСертификатов</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>20</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВерсияПоддерживаемогоРегистрационногоПакета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ПоддерживаетсяОбменБезПриглашений</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ИдентификаторОператора</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>10</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

БухЭксп/CommonModules/СервисНастроекЭДОПовтИсп/Ext/Module.bsl
//@strict-types
#Область СлужебныйПрограммныйИнтерфейс

// Оператор поддерживает формат пакета регистрации с версией не ниже указанной.
// 
// Параметры:
//  ИдентификаторОператора - Строка - идентификатор оператора
//  Версия - Строка - целевая версия для сравнения
// 
// Возвращаемое значение:
//  Булево - Истина, если поддерживает
Функция ОператорПоддерживаетВерсиюФорматаРегистрации(ИдентификаторОператора, Версия) Экспорт
	
	Если Не ЗначениеЗаполнено(ИдентификаторОператора) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	ВерсияОператора = РегистрыСведений.ОператорыЭДО.ВерсияПоддерживаемогоРегистрационногоПакета(ИдентификаторОператора);
	
	Если Не ЗначениеЗаполнено(ВерсияОператора) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	Возврат СервисЭДОКлиентСервер.СравнитьВерсииФорматовРегистрации(ВерсияОператора, Версия) >= 0;
	
КонецФункции

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает объект HTTPСоединение для работы с сервисом электронного документооборота.
// 
// Параметры:
// 	Таймаут - Число
// 	НоваяВерсияАПИСервиса1СЭДО - Булево - использовать API v2 сервиса.
// Возвращаемое значение:
// 	см. ИнтернетСоединениеБЭД.ОписаниеHTTPСоединения
Функция СоединениеССервисом(Таймаут = 30) Экспорт
	
	Возврат ИнтернетСоединениеБЭД.ОписаниеHTTPСоединения(СервисНастроекЭДО.АдресСервисаНастроек(), Таймаут);
	
КонецФункции

// Возвращает неподдерживемые операторами форматы.
// 
// Возвращаемое значение:
//  Соответствие из КлючИЗначение:
//   * Ключ - Строка - идентификатор оператора
//   * Значение - Массив из Строка - идентификаторы форматов
//
Функция НеподдерживаемыеОператорамиФорматы() Экспорт
	
	Результат = Новый Соответствие;
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ
	|	ОператорыЭДО.ИдентификаторОператора КАК ИдентификаторОператора,
	|	ОператорыЭДО.НеподдерживаемыеФорматы КАК НеподдерживаемыеФорматы
	|ИЗ
	|	РегистрСведений.ОператорыЭДО КАК ОператорыЭДО";
	Выборка = Запрос.Выполнить().Выбрать();
	
	Пока Выборка.Следующий() Цикл
		Если ПустаяСтрока(Выборка.НеподдерживаемыеФорматы) Тогда
			Продолжить;
		КонецЕсли;
		Результат.Вставить(Выборка.ИдентификаторОператора,
			ОбщегоНазначения.JSONВЗначение(Выборка.НеподдерживаемыеФорматы, Неопределено, Истина));
	КонецЦикла;
	
	Возврат Результат;
	
КонецФункции

// см. РегистрыСведений.ОператорыЭДО.ВерсияПоддерживаемогоРегистрационногоПакета
Функция ВерсияПоддерживаемогоРегистрационногоПакетаОператора(ИдентификаторОператора) Экспорт
	
	Возврат РегистрыСведений.ОператорыЭДО.ВерсияПоддерживаемогоРегистрационногоПакета(ИдентификаторОператора);
	
КонецФункции

// см. РегистрыСведений.ОператорыЭДО.ОператорПоддерживаетОбменБезПриглашений
Функция ОператорПоддерживаетОбменБезПриглашений(ИдентификаторОператора) Экспорт
	
	Возврат РегистрыСведений.ОператорыЭДО.ОператорПоддерживаетОбменБезПриглашений(ИдентификаторОператора);
	
КонецФункции

#КонецОбласти
